LogFilesWrk2/HtmlPerfectClientWrk2V1bc.txt
Running 5m test @ http://169.254.32.152:8181/htmlPerfect
  2 threads and 5 connections
  Thread calibration: mean lat.: 3.924ms, rate sampling interval: 13ms
  Thread calibration: mean lat.: 3.915ms, rate sampling interval: 12ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.35ms    1.33ms  55.10ms   87.17%
    Req/Sec    53.16     66.01   181.00     74.61%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.18ms
 75.000%    3.84ms
 90.000%    4.57ms
 99.000%    6.10ms
 99.900%   12.93ms
 99.990%   52.10ms
 99.999%   55.13ms
100.000%   55.13ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.971     0.000000            1         1.00
       2.267     0.100000         2912         1.11
       2.561     0.200000         5823         1.25
       2.779     0.300000         8706         1.43
       2.979     0.400000        11605         1.67
       3.183     0.500000        14520         2.00
       3.285     0.550000        15951         2.22
       3.403     0.600000        17418         2.50
       3.531     0.650000        18852         2.86
       3.669     0.700000        20302         3.33
       3.835     0.750000        21747         4.00
       3.927     0.775000        22477         4.44
       4.027     0.800000        23201         5.00
       4.135     0.825000        23926         5.71
       4.259     0.850000        24664         6.67
       4.399     0.875000        25382         8.00
       4.483     0.887500        25740         8.89
       4.571     0.900000        26100        10.00
       4.667     0.912500        26462        11.43
       4.779     0.925000        26831        13.33
       4.911     0.937500        27186        16.00
       4.995     0.943750        27373        17.78
       5.079     0.950000        27548        20.00
       5.175     0.956250        27731        22.86
       5.307     0.962500        27910        26.67
       5.419     0.968750        28090        32.00
       5.495     0.971875        28182        35.56
       5.559     0.975000        28272        40.00
       5.635     0.978125        28363        45.71
       5.707     0.981250        28453        53.33
       5.827     0.984375        28545        64.00
       5.883     0.985938        28590        71.11
       5.939     0.987500        28635        80.00
       6.027     0.989062        28680        91.43
       6.159     0.990625        28726       106.67
       6.323     0.992188        28770       128.00
       6.399     0.992969        28793       142.22
       6.487     0.993750        28815       160.00
       6.567     0.994531        28840       182.86
       6.627     0.995313        28861       213.33
       6.739     0.996094        28883       256.00
       6.823     0.996484        28895       284.44
       6.955     0.996875        28906       320.00
       7.019     0.997266        28917       365.71
       7.183     0.997656        28929       426.67
       7.859     0.998047        28940       512.00
       8.319     0.998242        28946       568.89
       9.183     0.998437        28951       640.00
      10.247     0.998633        28957       731.43
      12.199     0.998828        28963       853.33
      13.671     0.999023        28968      1024.00
      14.263     0.999121        28971      1137.78
      15.223     0.999219        28974      1280.00
      18.767     0.999316        28977      1462.86
      19.247     0.999414        28980      1706.67
      22.991     0.999512        28982      2048.00
      24.879     0.999561        28984      2275.56
      29.151     0.999609        28985      2560.00
      34.271     0.999658        28987      2925.71
      34.367     0.999707        28988      3413.33
      47.007     0.999756        28989      4096.00
      47.295     0.999780        28990      4551.11
      50.015     0.999805        28991      5120.00
      50.143     0.999829        28992      5851.43
      50.143     0.999854        28992      6826.67
      52.095     0.999878        28993      8192.00
      52.095     0.999890        28993      9102.22
      52.255     0.999902        28994     10240.00
      52.255     0.999915        28994     11702.86
      52.255     0.999927        28994     13653.33
      55.103     0.999939        28995     16384.00
      55.103     0.999945        28995     18204.44
      55.103     0.999951        28995     20480.00
      55.103     0.999957        28995     23405.71
      55.103     0.999963        28995     27306.67
      55.135     0.999969        28996     32768.00
      55.135     1.000000        28996          inf
#[Mean    =        3.349, StdDeviation   =        1.326]
#[Max     =       55.104, Total count    =        28996]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  30002 requests in 5.00m, 42.52MB read
Requests/sec:    100.01
Transfer/sec:    145.12KB

 >> |2017/09/08 16:56:03|HtmlPerfectClientWrk2V1bc|Perfect HTML benchmarking
wrk2 -t2 -d5m -c5 --latency -R100 --timeout 100s http://169.254.32.152:8181/htmlPerfect