LogFilesWrk2/HtmlVaporClientWrk2V1.txt
Running 30s test @ http://169.254.162.211:8080/htmlVapor
  2 threads and 5 connections
  Thread calibration: mean lat.: 1.739ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.728ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.49ms    3.61ms  47.20ms   92.46%
    Req/Sec     2.66k   626.72     5.67k    79.30%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.63ms
 75.000%    2.43ms
 90.000%    5.18ms
 99.000%   13.39ms
 99.900%   43.04ms
 99.990%   46.21ms
 99.999%   46.94ms
100.000%   47.23ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.246     0.000000            1         1.00
       0.627     0.100000        10011         1.11
       0.881     0.200000        20041         1.25
       1.135     0.300000        30000         1.43
       1.381     0.400000        39996         1.67
       1.634     0.500000        50013         2.00
       1.767     0.550000        55022         2.22
       1.903     0.600000        59998         2.50
       2.042     0.650000        65013         2.86
       2.205     0.700000        69998         3.33
       2.429     0.750000        75009         4.00
       2.587     0.775000        77512         4.44
       2.837     0.800000        79988         5.00
       3.215     0.825000        82486         5.71
       3.751     0.850000        84990         6.67
       4.395     0.875000        87488         8.00
       4.767     0.887500        88738         8.89
       5.183     0.900000        89990        10.00
       5.635     0.912500        91236        11.43
       6.119     0.925000        92488        13.33
       6.639     0.937500        93742        16.00
       6.947     0.943750        94359        17.78
       7.283     0.950000        94985        20.00
       7.671     0.956250        95609        22.86
       8.099     0.962500        96233        26.67
       8.591     0.968750        96862        32.00
       8.879     0.971875        97178        35.56
       9.167     0.975000        97483        40.00
       9.487     0.978125        97802        45.71
       9.879     0.981250        98111        53.33
      10.351     0.984375        98425        64.00
      10.703     0.985938        98577        71.11
      11.183     0.987500        98733        80.00
      12.383     0.989062        98889        91.43
      14.407     0.990625        99045       106.67
      20.063     0.992188        99202       128.00
      23.663     0.992969        99280       142.22
      26.703     0.993750        99359       160.00
      30.351     0.994531        99436       182.86
      34.047     0.995313        99514       213.33
      37.471     0.996094        99593       256.00
      38.399     0.996484        99631       284.44
      39.295     0.996875        99671       320.00
      39.871     0.997266        99711       365.71
      40.543     0.997656        99750       426.67
      41.183     0.998047        99788       512.00
      41.503     0.998242        99809       568.89
      41.887     0.998437        99828       640.00
      42.239     0.998633        99848       731.43
      42.687     0.998828        99866       853.33
      43.135     0.999023        99886      1024.00
      43.391     0.999121        99897      1137.78
      43.583     0.999219        99904      1280.00
      44.031     0.999316        99914      1462.86
      44.319     0.999414        99925      1706.67
      44.671     0.999512        99935      2048.00
      44.895     0.999561        99939      2275.56
      44.991     0.999609        99943      2560.00
      45.119     0.999658        99948      2925.71
      45.471     0.999707        99954      3413.33
      45.599     0.999756        99958      4096.00
      45.727     0.999780        99961      4551.11
      45.823     0.999805        99963      5120.00
      46.015     0.999829        99966      5851.43
      46.079     0.999854        99968      6826.67
      46.175     0.999878        99970      8192.00
      46.207     0.999890        99972      9102.22
      46.399     0.999902        99973     10240.00
      46.463     0.999915        99974     11702.86
      46.591     0.999927        99975     13653.33
      46.783     0.999939        99977     16384.00
      46.783     0.999945        99977     18204.44
      46.847     0.999951        99978     20480.00
      46.847     0.999957        99978     23405.71
      46.879     0.999963        99979     27306.67
      46.879     0.999969        99979     32768.00
      46.911     0.999973        99980     36408.89
      46.911     0.999976        99980     40960.00
      46.911     0.999979        99980     46811.43
      46.943     0.999982        99981     54613.33
      46.943     0.999985        99981     65536.00
      46.943     0.999986        99981     72817.78
      46.943     0.999988        99981     81920.00
      46.943     0.999989        99981     93622.86
      47.231     0.999991        99982    109226.67
      47.231     1.000000        99982          inf
#[Mean    =        2.487, StdDeviation   =        3.611]
#[Max     =       47.200, Total count    =        99982]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  150039 requests in 30.00s, 224.51MB read
Requests/sec:   5001.36
Transfer/sec:      7.48MB

 >> |2017/09/06 20:16:23|HtmlVaporClientWrk2V1|Vapor HTML benchmarking
wrk2 -t2 -d30s -c5 --latency -R5002 --timeout 100s http://169.254.162.211:8080/htmlVapor